app/controllers/my_backup_controller.rb

	def doBackup
    begin
      @account = EmailAccount.new(params[:email_account])
      if @account.valid?
        # Great we're valid so let's go get the mail!!
	      @bmm_process = MyBackupHelper::BackupMyMail.new(@account)
	      if @bmm_process.authenticated?
	        flash_message = "We were able to successfully connect to your mailbox!\n"
	        result_of_backup = @bmm_process.runBackup()
	        flash_message += result_of_backup
	        flash.now[:notice] = flash_message
	        case result_of_backup
	          when /^Successfully/
	            thankYouText = thank_you_message()
	            # obsfucated_Link will be generated with SHA1::Hash
	            backup_link = MailBackup.create({:file_path => @bmm_process.backup_dir})
---
INSERT INTO "mail_backups" ("file_path", "created_at", "obsfucated_link", "updated_at") VALUES('/home/jholt/DEV/RUBY/REGULAR/BackupMyMail-rails/app/helpers/../../public/backups/1234378165.20783_joshholt.testaccount@gmail.com', '2009-02-11 18:49:29', '7e4257f6e0207e59e336d258387416dd2ed35a38', '2009-02-11 18:49:29')

	def download
	  begin
	    @customers_backup = MailBackup.find_by_obsfucated_link(params[:id])
---
SELECT * FROM "mail_backups" WHERE ("mail_backups"."obsfucated_link" = '7e4257f6e0207e59e336d258387416dd2ed35a38') LIMIT 1